//****************************************************************************************************************************************//
//* @ UTF-8                             
//* @ 作者：哔哩哔哩：山神sharp or 重庆市黔江区民族职业教育中心：曾志伟    
//* @ 创建时间：2023.6.4                    
//* @ 最近更新时间：2024.11.23
//* @ 版本：v1.3
//* @ 开源协议：BSD 
//* @ GetHub主页: https://github.com/ZhiweiZengPRC?tab=repositories
//* @ 哔哩哔哩主页：https://space.bilibili.com/1804238615/dynamic
//* @ 抖音主页：https://www.douyin.com/user/self?from_tab_name=main
//****************************************************************************************************************************************//
//* @ UTF-8                             
//* @ Author: Bilibili: 山神Sharp or Chongqing Qianjiang District Ethnic Vocational Education Center: Zeng Zhiwei    
//* @ Creation time: 2023.6.4                  
//* @ Last updated: 2024.11.23
//* @ Version: v1.3
//* @ Open Source License: BSD 
//* @GetHub Homepage: https://github.com/ZhiweiZengPRC?tab=repositories
//* @ Bilibili Homepage: https://space.bilibili.com/1804238615/dynamic
//* @ Douyin homepage: https://www.douyin.com/user/self?from_tab_name=main
//****************************************************************************************************************************************//

//****************************************************************************************************************************************//
// 导入
//****************************************************************************************************************************************//

#include "stm32f10x.h"
#include "zw32.h"

//****************************************************************************************************************************************//
// 延时函数部分//
//****************************************************************************************************************************************//

void delay(u16 nms) // 毫秒级，仿Arduino写法命的函数名
{
  u32 temp;
  SysTick->LOAD = 9000*nms;
  SysTick->VAL=0X00;//清空计数器
  SysTick->CTRL=0X01;//使能，减到零是无动作，采用外部时钟源
  do
  {
    temp=SysTick->CTRL;//读取当前倒计数值
  }
	while((temp&0x01)&&(!(temp&(1<<16))));//等待时间到达
    SysTick->CTRL=0x00; //关闭计数器
    SysTick->VAL =0X00; //清空计数器
}

//****************************************************************************************************************************************//
// GPIO初始化部分in//
//****************************************************************************************************************************************//

void gpio_setup(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;        
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);    
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3 | GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7;     
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;    
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;     
	GPIO_Init(GPIOA,&GPIO_InitStructure); 
}

//****************************************************************************************************************************************//
// GPIO初始化部分out//
//****************************************************************************************************************************************//

void gpio_out_setup(void)
{
	GPIO_InitTypeDef KEY_InitStruct;
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
	KEY_InitStruct.GPIO_Mode = GPIO_Mode_IPU;
	KEY_InitStruct.GPIO_Pin = GPIO_Pin_0|GPIO_Pin_1;
	GPIO_Init(GPIOB,&KEY_InitStruct);
}

//****************************************************************************************************************************************//

// 添加区

//****************************************************************************************************************************************//

//****************************************************************************************************************************************//
// Zheng Zhiwei//2023.6.14-2024.11.23//v1.3// 
//****************************************************************************************************************************************//

